mdl_puma560;
t1=[-1,0,0,0.5;0,1,0,-0.3;0,0,-1,-0.3;0,0,0,1];  %起始位置
t2=[-1,0,0,0.5;0,1,0,-0.3;0,0,-1,0;0,0,0,1];    %中间点1
t3=[-1,0,0,0.5;0,1,0,0.3;0,0,-1,0;0,0,0,1];     %中间点2
t4=[-1,0,0,0.5;0,1,0,0.3;0,0,-1,-0.3;0,0,0,1];   %终止位置
r(1,:)=p560.ikine6s(t1);   %逆求解
r(2,:)=p560.ikine6s(t2);
r(3,:)=p560.ikine6s(t3);  
r(4,:)=p560.ikine6s(t4);
r(2,2)=r(2,2)-2*pi;   %为了让机器人按较简单的短路径运动，需要某些关节角减去2*pi
r(3,2)=r(3,2)-2*pi;
r(1,6)=r(1,6)-2*pi;
r(2,6)=r(2,6)-2*pi;
for i=1:6  
    for j=0:19
        ftr(j+1,i)=r(1,i)+j*(r(2,i)-r(1,i))/20;   %计算运动轨迹（位移-时间曲线为直线）
    end
    for j=20:59
        ftr(j+1,i)=r(2,i)+(j-20)*(r(3,i)-r(2,i))/40;
    end
    for j=60:90
        ftr(j+1,i)=r(3,i)+(j-60)*(r(4,i)-r(3,i))/30;
    end
    x=1:91;
    figure(1);
    subplot(2,3,i);
    plot(x,ftr(x,i));
end
figure(5601);
p560.plot(ftr);
