t1=[-1,0,0,0.3;0,1,0,-0.3;0,0,-1,0.3;0,0,0,1];  %起始位置
t4=[-1,0,0,0.5;0,1,0,0.3;0,0,-1,0.3;0,0,0,1];     %中间点2
t5=[-1,0,0,0.5;0,1,0,0.3;0,0,-1,0;0,0,0,1];   %放置
while(1)
    loc=importdata('location.txt'); %预计功能：由图像识别部分不断更新文件中的坐标。轨迹根据读取文件得到的坐标规划。通过标志位在两个进程间通信。
    while(loc(5)==0)   %标志位
    end
    loc(5)=0;
    loc=loc/2000;
    t3=[-1,0,0,loc(1)+loc(3)/2;0,1,0,-loc(2)-loc(4)/2;0,0,-1,0;0,0,0,1];
    t2=[-1,0,0,loc(1)+loc(3)/2;0,1,0,-loc(2)-loc(4)/2;0,0,-1,0.3;0,0,0,1];
    fullt(t1,t2,t3,t4,t5);
    %break;
end